import json

def get_2025_season_data():
    return {
        "labels": ["3월", "4월", "5월", "6월", "7월", "8월", "9월", "10월"],
        "teams_data": {
            'LG':   [1, 1, 1, 2, 2, 1, 1, 1],
            '한화': [7, 3, 2, 1, 1, 2, 2, 2],
            'SSG':  [2, 7, 6, 5, 4, 3, 3, 3],
            '삼성': [2, 2, 5, 7, 7, 5, 4, 4],
            'NC':   [6, 9, 8, 8, 8, 7, 5, 5],
            'KT':   [4, 5, 4, 6, 5, 6, 6, 6],
            '롯데': [9, 4, 3, 3, 3, 4, 7, 7],
            'KIA':  [7, 6, 7, 4, 6, 8, 8, 8],
            '두산': [10, 8, 9, 9, 9, 9, 9, 9],
            '키움': [5, 10, 10, 10, 10, 10, 10, 10]
        }
    }
    
# 테스트 용  출력 코드
'''if __name__ == "__main__":

    # 함수 실행
    data = get_2025_season_data()

    # JSON 출력
    json_output = json.dumps(data, ensure_ascii=False, indent=4)
    print(json_output)
    '''
    
